---
title: PerformanceFailures
classe: Autodesk.Revit.DB.BuiltInFailures+PerformanceFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 17
---

# PerformanceFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ClippingIsDisabled { get; }` | `PerformanceFailures.ClippingIsDisabled` | FailureDefinitionId |
| `FailureDefinitionId DisjoinedSolidsInInPlaceFamily { get; }` | `PerformanceFailures.DisjoinedSolidsInInPlaceFamily` | FailureDefinitionId |
| `FailureDefinitionId DuplicateInstances { get; }` | `PerformanceFailures.DuplicateInstances` | FailureDefinitionId |
| `FailureDefinitionId FamilyContainsViewSpecificImports { get; }` | `PerformanceFailures.FamilyContainsViewSpecificImports` | FailureDefinitionId |
| `FailureDefinitionId HostHasTooManyInserts { get; }` | `PerformanceFailures.HostHasTooManyInserts` | FailureDefinitionId |
| `FailureDefinitionId InteriorCategoriesEnabledInLargeView { get; }` | `PerformanceFailures.InteriorCategoriesEnabledInLargeView` | FailureDefinitionId |
| `FailureDefinitionId LargeFamilyFile { get; }` | `PerformanceFailures.LargeFamilyFile` | FailureDefinitionId |
| `FailureDefinitionId ManyElementInFamily { get; }` | `PerformanceFailures.ManyElementInFamily` | FailureDefinitionId |
| `FailureDefinitionId ManyUnusedNestedFamilies { get; }` | `PerformanceFailures.ManyUnusedNestedFamilies` | FailureDefinitionId |
| `FailureDefinitionId MultipleLoopsInSketch { get; }` | `PerformanceFailures.MultipleLoopsInSketch` | FailureDefinitionId |
| `FailureDefinitionId TooLargeSketch { get; }` | `PerformanceFailures.TooLargeSketch` | FailureDefinitionId |
| `FailureDefinitionId TooManyAreaBoundaryLinesFound { get; }` | `PerformanceFailures.TooManyAreaBoundaryLinesFound` | FailureDefinitionId |
| `FailureDefinitionId TooManyElementsInSketch { get; }` | `PerformanceFailures.TooManyElementsInSketch` | FailureDefinitionId |
| `FailureDefinitionId UnjoinedRoomSeparationLinesFound { get; }` | `PerformanceFailures.UnjoinedRoomSeparationLinesFound` | FailureDefinitionId |
| `FailureDefinitionId UnusedTypesInTheProject { get; }` | `PerformanceFailures.UnusedTypesInTheProject` | FailureDefinitionId |
| `FailureDefinitionId ViewDetailLevelIsHighInLargeView { get; }` | `PerformanceFailures.ViewDetailLevelIsHighInLargeView` | FailureDefinitionId |
| `FailureDefinitionId WallsOverlap { get; }` | `PerformanceFailures.WallsOverlap` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```